<?php
// +----------------------------------------------------------------------
// | OneThink [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2013 http://www.onethink.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: 麦当苗儿 <zuojiazi@vip.qq.com> <http://www.thinkphp.cn>
// +----------------------------------------------------------------------


/**
 * 前台配置文件
 * 所有除开系统级别的前台配置
 */


return array(

	
	'POLLS_STATUS' => array(
		'1' =>'未提交',
		'2' =>'初审中',
		'3' =>'终审中',
		'4' =>'初审退回',
		'5' =>'终审退回',
		'6' =>'终审完成',
	),
	
	//社情民意浏览权限配置
    'POLLS_VIEW_STATUS' =>  array(
	    '委员' => array(1,2,'2,6',4),
	    '集体' => array(1,2,'2,6',4),
	    '政协办公室' =>  array(2,3,5),
	    
	    '办公室主任' =>   array(3,6)

    ),

);

